Repository: PHxii256/flutter-chat-app
Catalog: chat_app/lib/l10n/intl_*.arb
Languages: ar_eg

source: Enter Chat Room
ar_eg: أدخل غرفة الشات

source: Username
ar_eg: اسم المستخدم

source: Room Code
ar_eg: رمز الغرفة

source: Start Chatting
ar_eg: ابدأ الدردشة

# chatRoomTitle
source: Chat Room #{roomCode}
ar_eg: غرفة الشات #{roomCode}

source: Enter message
ar_eg: اكتب رسالة

source: React to Message
ar_eg: تفاعل مع الرسالة

source: Show Reactions
ar_eg: إظهار التفاعلات

source: Reply to Message
ar_eg: الرد على الرسالة

source: Edit Message
ar_eg: تعديل الرسالة

source: Delete Message
ar_eg: حذف الرسالة

source: No reactions yet
ar_eg: لا توجد تفاعلات بعد

source: No Recents
ar_eg: لا توجد حديثة

# errorMessage
source: Error: {error}
ar_eg: خطأ: {error}

# replyTo
source: Reply to {username}
ar_eg: الرد على {username}

# replyingTo
source: Replying to {message}
ar_eg: رداً على {message}

source: Editing Message
ar_eg: تعديل الرسالة
